copilot_app/app/controllers/activities_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def show
    @user = User.find(params[:user_id])
    @activity = Activity.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "activities" ("name", "category", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "NEW ONE NOW"], ["category", "test"], ["user_id", 1], ["created_at", "2019-05-06 20:27:26.095693"], ["updated_at", "2019-05-06 20:27:26.095693"]]
---
  def create
    @user = User.find(params[:user_id])
    @activity = Activity.new(activity_params)
    @user.activities << @activity

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "activities" SET "name" = $1, "category" = $2, "updated_at" = $3 WHERE "activities"."id" = $4  [["name", "UPDATE UPDATE UPDATE"], ["category", "add skills"], ["updated_at", "2019-05-08 21:10:50.261974"], ["id", 1]]
---
  def update
    @user = User.find(params[:user_id])
    @activity = Activity.find(activity_params)
    if @activity.update(activity_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "activities" WHERE "activities"."id" = $1  [["id", 3]]
---
  def destroy
    @user = User.find(params[:user_id])
    @activity = Activity.destroy(activity_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def set_activity
    @user = User.find(params[:user_id])
    @activity = Activity.find(params[:id])