copilot_app/app/controllers/activities_controller.rb

  def index
    @activities = Activity.all
---
SELECT "activities".* FROM "activities" ORDER BY "activities"."id" ASC